#+PROPERTY: header-args :session pandas
** Charger les modules
#+begin_src python :results output 
  import numpy as np
  import pandas as pd

  print("ok pour les modules")
#+end_src

#+RESULTS:
: ok pour les modules
*** Exemple
#+begin_src python :results value
  S1 = pd.Series(data=range(4), name="nom", index=["s","a","g","h"])
  S1
#+end_src

#+RESULTS:
: s    0
: a    1
: g    2
: h    3
: Name: nom, dtype: int64

*** avec un dico
#+begin_src python :results value
  dico = {"col1" : [1,5,9], "col2" : [7,5,3]}
  df1 = pd.DataFrame(dico)
  df1
#+end_src

#+RESULTS:
:    col1  col2
: 0     1     7
: 1     5     5
: 2     9     3
*** avec un array ou liste de liste
#+begin_src python :results value :replace
  df2 = pd.DataFrame(np.random.rand(3,3), index = ["l0","l1","l2"], columns=["col1", "col2", "col3"])
  df2
#+end_src

#+RESULTS:
:         col1      col2      col3
: l0  0.084316  0.722785  0.277065
: l1  0.635991  0.038104  0.671831
: l2  0.616858  0.461467  0.331659
*** Exemple
+ "li" ou i accède aux valeurs de la ligne li ou i
  #+begin_src python :results value
    df2.loc["l1"]
  #+end_src

  #+RESULTS:
  : col1    0.635991
  : col2    0.038104
  : col3    0.671831
  : Name: l1, dtype: float64

  #+begin_src python :results value
    df2.iloc[1]
  #+end_src

  #+RESULTS:
  : col1    0.635991
  : col2    0.038104
  : col3    0.671831
  : Name: l1, dtype: float64

+ idem pour les colonnes
  #+begin_src python :results value
    df2.loc[:,"col2"]
  #+end_src

  #+RESULTS:
  : l0    0.722785
  : l1    0.038104
  : l2    0.461467
  : Name: col2, dtype: float64

  #+begin_src python :results value :replace
    df2.iloc[:, 1]
  #+end_src

  #+RESULTS:
  : l0    0.722785
  : l1    0.038104
  : l2    0.461467
  : Name: col2, dtype: float64
** Convertir une serie en liste
+ Series.tolist
  
#+begin_src python :results output
  print(type(df2["col1"].to_numpy()))
#+end_src

#+RESULTS:
: <class 'numpy.ndarray'>
